Members = {
    "65705325" : {"ชื่อจริง-นามสกุล" : "ณัฐพันธ์ จันทร์ไกรทอง","ชื่อเล่น" : "เพชร"}, 
    "65709743" : {"ชื่อจริง-นามสกุล" : "จักรกฤษณ์ วารี","ชื่อเล่น" : "ฟลุ๊ค"}
}

print(Members)


id = int(input("กรอกรหัสนักศึกษา : "))
Members.update({ id : {"ชื่อจริง-นามสกุล": input("กรอกชื่อจริง: "), "ชื่อเล่น": input("กรอกชื่อเล่น: ")}})
id = int(input("กรอกรหัสนักศึกษา : "))
Members.update({ id : {"ชื่อจริง-นามสกุล": input("กรอกชื่อจริง: "), "ชื่อเล่น": input("กรอกชื่อเล่น: ")}})
id = int(input("กรอกรหัสนักศึกษา : "))
Members.update({ id : {"ชื่อจริง-นามสกุล": input("กรอกชื่อจริง: "), "ชื่อเล่น": input("กรอกชื่อเล่น: ")}})
id = int(input("กรอกรหัสนักศึกษา : "))
Members.update({ id : {"ชื่อจริง-นามสกุล": input("กรอกชื่อจริง: "), "ชื่อเล่น": input("กรอกชื่อเล่น: ")}})
print(Members)

m = Members.get(int(input("กรอกรหัสนักศึกษาที่ต้องการค้นหา : ")))
print(m)


